/************************************************************************/
/* 该模块为http服务相关模块                                             */
/************************************************************************/
#pragma once
#ifndef _MOON_HTTP_SERVICE_H
#define _MOON_HTTP_SERVICE_H

#ifdef MS_WINDOWS
#include <winsock2.h>
#include <MSWSock.h>
#pragma comment(lib,"ws2_32.lib")
#endif

#ifdef __cplusplus
extern "C" {
#endif

	/************************************************************************/
	/* http上下文，传递给线程参数                                           */
	/************************************************************************/
	typedef struct _moon_http_context{
#ifdef MS_WINDOWS
		SOCKET m_socket;
#endif
	}moon_http_context;


	/************************************************************************/
	/* 启动http服务                                                         */
	/************************************************************************/
	bool lauch_http_service();

	/************************************************************************/
	/* 停止http服务                                                         */
	/************************************************************************/
	bool end_http_service();

#ifdef __cplusplus
}
#endif

#endif